In [7]:
import pandas as pd

In [8]:
import numpy as np

In [9]:
from sklearn.linear_model import LinearRegression

In [10]:
df=pd.read_csv("https://raw.githubusercontent.com/Farhingithub/DataSet/main/house_price.csv")

In [11]:
df

,Unnamed: 0,Location,BHK,Furnishing,Sq.ft,Old(years),Floor,Price
0,37,Whitefield,3,1,3000,1,3,28000
1,43,Bommanahalli,3,1,1650,10,0,18000
2,12,Whitefield,2,0,1000,5,3,16400
3,8,Whitefield,3,0,1600,1,9,27000
4,9,Whitefield,2,1,1200,5,1,20000
...,...,...,...,...,...,...,...,...
995,48,Bommanahalli,3,1,1460,1,2,25000
996,0,Whitefield,3,0,2100,1,7,28000
997,42,Bommanahalli,2,0,1033,5,0,16500
998,39,Bommanahalli,3,0,1500,10,1,22000
999,3,Whitefield,3,1,1768,5,11,30000

In [12]:
df.shape

(1000, 8)

In [13]:
df.head()

   Unnamed: 0      Location  BHK  Furnishing  Sq.ft  Old(years)  Floor  Price
0          37    Whitefield    3           1   3000           1      3  28000
1          43  Bommanahalli    3           1   1650          10      0  18000
2          12    Whitefield    2           0   1000           5      3  16400
3           8    Whitefield    3           0   1600           1      9  27000
4           9    Whitefield    2           1   1200           5      1  20000

In [15]:
df=df.drop_duplicates()
df.shape

(51, 8)

In [16]:
df.count()

Unnamed: 0    51
Location      51
BHK           51
Furnishing    51
Sq.ft         51
Old(years)    51
Floor         51
Price         51
dtype: int64

In [17]:
df.dtypes

Unnamed: 0     int64
Location      object
BHK            int64
Furnishing     int64
Sq.ft          int64
Old(years)     int64
Floor          int64
Price          int64
dtype: object

In [18]:
df.isna().sum()

Unnamed: 0    0
Location      0
BHK           0
Furnishing    0
Sq.ft         0
Old(years)    0
Floor         0
Price         0
dtype: int64

In [19]:
df.max()

Unnamed: 0            49
Location      Whitefield
BHK                    3
Furnishing             1
Sq.ft               3155
Old(years)            10
Floor                 13
Price              45000
dtype: object

In [20]:
df.min()

Unnamed: 0               0
Location      Bommanahalli
BHK                      2
Furnishing               0
Sq.ft                  767
Old(years)               1
Floor                    0
Price                11000
dtype: object

In [21]:
#data prepration

In [22]:
#df=df.iloc [ : ,1: ]

In [23]:
df=df.drop(["Unnamed: 0"],axis=1)

In [24]:
df.head()

       Location  BHK  Furnishing  Sq.ft  Old(years)  Floor  Price
0    Whitefield    3           1   3000           1      3  28000
1  Bommanahalli    3           1   1650          10      0  18000
2    Whitefield    2           0   1000           5      3  16400
3    Whitefield    3           0   1600           1      9  27000
4    Whitefield    2           1   1200           5      1  20000

In [31]:
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.metrics import accuracy_score

In [32]:
label_enc= LabelEncoder()

In [33]:
df['Location']=label_enc.fit_transform(df['Location'])

In [34]:
df.head()

   Location  BHK  Furnishing  Sq.ft  Old(years)  Floor  Price
0         1    3           1   3000           1      3  28000
1         0    3           1   1650          10      0  18000
2         1    2           0   1000           5      3  16400
3         1    3           0   1600           1      9  27000
4         1    2           1   1200           5      1  20000

In [35]:
#data preparation
x=df.drop('Price',axis=1)

In [36]:
y=df['Price']

In [37]:
x.head()

   Location  BHK  Furnishing  Sq.ft  Old(years)  Floor
0         1    3           1   3000           1      3
1         0    3           1   1650          10      0
2         1    2           0   1000           5      3
3         1    3           0   1600           1      9
4         1    2           1   1200           5      1

In [38]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.25)

In [39]:
x_train.head()

    Location  BHK  Furnishing  Sq.ft  Old(years)  Floor
6          1    3           1   1870          10      3
10         1    2           0   1326           1      3
9          1    3           0   1704           5     13
21         0    2           0   1033           5      0
74         0    2           0   1400           5      2

In [44]:
x_train.shape

(38, 6)

In [45]:
x_test.shape

(13, 6)

In [40]:
print('x_train dataset',len(x_train))
print('y_train dataset',len(y_train))

x_train dataset 38
y_train dataset 38

In [43]:
print('x_test dataset',len(x_test))
print('x_test dataset',len(x_test))

x_test dataset 13
x_test dataset 13